{
  "A1": "Sammakieh Timbers",
  "A2": "Services",
  "A3": "About Us",
  "A4": "Products",
  "A5": "People",
  "A6": "Contact Us",
  "A7": "Supplying Quality Timber for",
  "A8": "Saudi Arabia's Growing Future",
  "A9": "Location",
  "A10": "31 Al Islam Street, Al Hamra",
  "A11": "Contact",
  "A12": "info@mhstimber.com",
  "A13": "+966 55 776 0117",
  "A14": "At Sammakieh Timbers, we believe that every great structure begins with a foundation of trust. That’s why we stand beside our clients, not just as suppliers but as partners, delivering wood solutions built on reliability, precision, and care.",
  "A15": "We go beyond trade; we simplify the entire process, from sourcing premium timber to managing logistics and ensuring smooth delivery, so you can focus on what truly matters: building with confidence.",
  "A16": "Sammakieh Timbers is more than a supplier; we are a partner in growth, dedicated to strengthening the foundations of tomorrow's projects with reliability, quality, and care.",
  "A17": "Exclusive Services",
  "A18": "At Sammakieh Timbers, we provide a full range of solutions to meet the growing demand for high-quality construction wood in Saudi Arabia. Our core service is importing premium timber from trusted international suppliers, ensuring a consistent and reliable source of wood for projects of all sizes.",
  "A19": "We understand that every project is unique, which is why we offer both standard dimensions and customized sizing to match your exact requirements. Whether you are building a private home, a commercial space, or a large-scale development, our team works closely with you to deliver the right materials on time and with precision.",
  "A20": "To make the process seamless, we handle logistics from port clearance to final delivery, giving you confidence that your wood arrives safely and when you need it. Beyond supply, we also offer expert guidance in selecting the most suitable types of wood, helping you balance quality, durability, and cost efficiency.",
  "A21": "Wood Beams",
  "A22": "WW Alwah",
  "A23": "Premium Wood Products",
  "A24": "Our Products",
  "A25": "Discover our comprehensive range of high-quality timber products designed to meet the diverse needs of construction projects across Saudi Arabia.",
  "A26": "Wood Planks (Swedish/Finnish)",
  "A27": "High-quality natural wood planks used in construction, finishing and decoration projects.",
  "A27_desc": "Distinguished by hardness, dimensional accuracy and ease of cutting and installation.",
  "A27_available": "Available in red and white wood from Sweden and Finland.",
  "A27_applications": "used for:",
  "A27_app1": "• Carpentry and construction work",
  "A27_app2": "• Ceilings and interior walls",
  "A27_app3": "• Light furniture and packaging",
  "A27_type": "Type: White/Red wood",
  "A28": "Wooden Beams (Swedish/Finnish)",
  "A29_desc": "Strong and cohesive sleepers made of Scandinavian spruce or pine wood, suitable for all construction and wood reinforcement works.",
  "A29_features": "Distinguished by their dryness and high straightness, ensuring consistent performance and long-term durability.",
  "A29_applications": "used for:",
  "A29_app1": "• Foundations and wooden structures",
  "A29_app2": "• Roofing and formwork",
  "A29_app3": "• Construction projects",
  "A29_type": "Type: White/Red wood",
  "A30": "Plywood Boards",
  "A31_desc": "Multi-layer boards made of high-quality wood, ensuring excellent load-bearing capacity and resistance to warping and moisture.",
  "A31_available": "Available in several types for indoor and outdoor use.",
  "A31_applications": "used for:",
  "A31_app1": "• Concrete formwork",
  "A31_app2": "• Furniture and kitchens",
  "A31_app3": "• Interior design and industrial packaging",
  "A31_dimensions": "Dimensions:",
  "A31_dims": "1220 × 2440 mm – Thickness from 9 to 18 mm",
  "A31_origin": "Origin: Malaysia / Russia / China / Indonesia",
  "A32": "About Sammakieh Timbers",
  "A33": "Learn more about our company, mission, and commitment to excellence in the timber industry.",
  "A34": "Our Mission",
  "A35": "To provide premium timber solutions that build the future of Saudi Arabia",
  "A36": "Our Vision",
  "A37": "To be the leading timber supplier in the region, known for quality and reliability",
  "A38": "Our Values",
  "A39": "Quality, reliability, and customer satisfaction are at the heart of everything we do",
  "A40": "Why Choose Us",
  "A41": "Experience the difference with our comprehensive timber solutions",
  "A42": "Ready to Start",
  "A43": "Get started with your timber project today",
  "A44": "Contact Now",
  "A45": "Talk to Experts",
  "A46": "Call Phone",
  "A47": "Send Email",
  "A48": "Get Quote Email",
  "A49": "Email Us",
  "A50": "Contact Form",
  "A51": "Fill Form",
  "A52": "Contact Us",
  "A53": "Get Free Quote",
  "A54": "Get Free Quote Description",
  "A55": "Get Quote",
  "A56": "Browse Products",
  "A57": "Customer Support",
  "A58": "Quality Guaranteed",
  "A59": "Fast Delivery",
  "A60": "Mounzer Sammakieh",
  "A61": "Management Team",
  "A62": "Experienced leaders guiding our company's vision",
  "A63": "Abdulrahman Alzbaji",
  "A64": "Sales Team",
  "A65": "Dedicated professionals helping you find the right solutions",
  "A66": "VETAP",
  "A67": "Technical Partner",
  "A68": "Our technology partner providing digital solutions and technical excellence",
  "A69": "Premium Timber Collection",
  "A70": "Structural Wood Beams",
  "A71": "Quality Wood Planks",
  "A72": "Plywood Boards",
  "A73": "Supplying Quality Timber for",
  "A74": "Saudi Arabia's Growing Future",
  "A75": "",
  "A76": "Our Products",
  "A77": "Discover our premium timber products and successful construction projects across Saudi Arabia",
  "A78": "View Products",
  "A79": "Why Choose Sammakieh Timbers?",
  "A80": "Experience the difference with our comprehensive timber solutions and exceptional service",
  "A81": "Premium quality timber from trusted international suppliers with strict quality control",
  "A82": "Fast and reliable delivery to your project site with complete logistics management",
  "A83": "Expert guidance and support throughout your project with professional consultation",
  "A84": "Get in touch with our experts today and discover how we can help with your timber needs.",
  "A85": "Professional timber services",
  "A86": "Comprehensive timber solutions for all your construction needs",
  "A87": "Our Services",
  "A88": "Building With Trust",
  "A89": "Sammakieh Timbers company building and facilities",
  "A90": "Professional team working with timber and construction materials",
  "A91": "",
  "A92": "",
  "A93": "",
  "A94": "",
  "A95": "Explore our comprehensive range of timber products designed for various construction needs",
  "A96": "Structural beams for construction projects of all sizes",
  "A97": "High-quality planks for various construction applications",
  "A98": "Tailored solutions to meet your specific project requirements",
  "A99": "Our Team",
  "A100": "Meet the dedicated professionals behind Sammakieh Timbers' success",
  "A101": "Mounzer Sammakieh - Management Team",
  "A102": "Sales Team",
  "A103": "VETAP Technical Partner",
  "A104": "Address",
  "A105": "Email",
  "A106": "Phone",
  "A107": "Business Hours",
  "A108": "Sunday - Thursday: 8:00 AM - 6:00 PM",
  "A109": "Friday: 2:00 PM - 6:00 PM",
  "A110": "Saturday: Closed",
  "A111": "First Name",
  "A112": "Last Name",
  "A113": "Message",
  "A114": "Your first name",
  "A115": "Your last name",
  "A116": "your.email@example.com",
  "A117": "+966 XX XXX XXXX",
  "A118": "Tell us about your project requirements...",
  "A119": "MHS Logo",
  "A120": "EN",
  "A121": "عربي",
  "A122": "Premium",
  "A123": "Timber Quality",
  "A124": "Reliable",
  "A125": "Service Delivery",
  "A126": "Trusted",
  "A127": "Industry Partner",
  "A128": "Excellence",
  "A129": "Our Commitment"
}
